In [3]:
import numpy as np
import pandas as pd

In [4]:
df = pd.DataFrame()

In [5]:
df

Empty DataFrame
Columns: []
Index: []

In [6]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [7]:
df2 = pd.DataFrame([[1,2,3,4], [5,6,7,8],[3,56,23,2], [34,64,7,54]])

In [8]:
df2

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   3  56  23   2
3  34  64   7  54

In [9]:
df2.head(2)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [10]:
df2.tail(2)

    0   1   2   3
2   3  56  23   2
3  34  64   7  54

In [11]:
df

Empty DataFrame
Columns: []
Index: []

In [12]:
df2

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   3  56  23   2
3  34  64   7  54